<?php
/***********************************************************
 * Расчет зарплаты менеджеров
 * Заказ считается закрытым, если ПОЛНОСТЬЮ отгружен и оплачен.
 * Для расчета в конкретном месяце берутся заказы:
 * ОПЛАЧЕННЫЕ в этом месяце, если отгружены ранее, 
 * и
 * ОТГРУЖЕННЫЕ в этом месяце, если оплачены ранее
 * 
 * Пример: 
 * заказ создан 01.01.2018, 
 * оплачен 1/2 часть 02.02.2018,
 * отгружен 1/2 часть 03.03.2018
 * отгружен 1/2 часть 07.03.2018
 * оплачен 1/2 часть 04.04.2018
 * Заказ засчитан в зарплату за 04 месяц.
 * 
 * Платежи: могут быть наличные и безналичные.
 * В одном платеже может быть сразу несколько заказов, 
 * как частично так и полностью оплаченных.
 * Отгрузки аналогично платежам.
 * 
 * Документы платежей: Document_ПоступлениеБезналичныхДенежныхСредств,
 *                     Document_ПриходныйКассовыйОрдер
 * Документы отгрузок: Document_РеализацияТоваровУслуг
 * 
 **********************************************************/

require 'vendor/autoload.php';

include_once 'php/00-conf.php';
include_once 'php/50-functions.php';
include_once 'php/79-1c-const.php';

// список наших контрагентов. заказы на них не идут в зарплату ( пцт на пцт, дп на дп и т.п.)
$nouse_Контрагенты = array( '969aы140-0a1f-11e7-6983-001e22348e39' => 'ИП Иванов Иван Иванович',
                            '58353082-c18b-11e4-7299-002e22348e39' => 'Сотрудники'
                            );
// готовим массив для сбора инфы по заказам
$Заказы = array();
//******************************************************************************
$raw = get1cData('Document_РеализацияТоваровУслуг',
            'ЗаказКлиента,Date,СуммаДокумента',
            'ЗаказКлиента_Type eq \'StandardODATA.Document_ЗаказКлиента\''
				);
foreach ($raw as $Реализация) {
    if ($Реализация['ЗаказКлиента'] == '00000000-0000-0000-0000-000000000000') { continue; }

    $Заказ_Key = trim($Реализация['ЗаказКлиента']);
    $ДатаРеализации = strtotime(trim($Реализация['Date']));
    $СуммаРеализации = trim($Реализация['СуммаДокумента']);
    
    if (array_key_exists($Заказ_Key,$Заказы)) { 
        //дополняем массив необходимыми значениями
        $Заказы[$Заказ_Key]['ДатаРеализации'][] = $ДатаРеализации;
        $Заказы[$Заказ_Key]['СуммаРеализации'][] = $СуммаРеализации;
        $Заказы[$Заказ_Key]['ОбщаяСуммаРеализации'] += $СуммаРеализации;
        $Заказы[$Заказ_Key]['ПоследняяДатаРеализации'] = max($Заказы[$Заказ_Key]['ДатаРеализации']);
    } else {
        // создаем новое значение массива с необходимыми дополнительными значениями
        $Заказы[$Заказ_Key] = array();
        $Заказы[$Заказ_Key]['ДатаРеализации'][] = $ДатаРеализации;
        $Заказы[$Заказ_Key]['СуммаРеализации'][] = $СуммаРеализации;
        $Заказы[$Заказ_Key]['ПоследняяДатаРеализации'] = $ДатаРеализации;
        $Заказы[$Заказ_Key]['ОбщаяСуммаРеализации'] = $СуммаРеализации;
        
        $Заказы[$Заказ_Key]['ДатаПлатежки'] = array();
        $Заказы[$Заказ_Key]['ПоследняяДатаПлатежки'] = 0;
        $Заказы[$Заказ_Key]['СуммаПлатежки'] = array();
        $Заказы[$Заказ_Key]['ОбщаяСуммаПлатежки'] = 0;
        
        $Заказы[$Заказ_Key]['ДатаЧека'] = array();
        $Заказы[$Заказ_Key]['ПоследняяДатаЧека'] = 0;
        $Заказы[$Заказ_Key]['СуммаЧека'] = array();
        $Заказы[$Заказ_Key]['ОбщаяСуммаЧека'] = 0;
    }
}
//******************************************************************************
$raw = get1cData('Document_ПоступлениеБезналичныхДенежныхСредств',
            'РасшифровкаПлатежа,Date',
                    ''
				);
foreach ($raw as $Платежка) {
    $ДатаПлатежки = strtotime(trim($Платежка['Date']));
    
    foreach ($Платежка['РасшифровкаПлатежа'] as $РасшифровкаПлатежа) {
        if ($РасшифровкаПлатежа['Заказ_Type'] != 'StandardODATA.Document_ЗаказКлиента') { continue; }
        if ($РасшифровкаПлатежа['Заказ'] == '00000000-0000-0000-0000-000000000000') { continue; }

        $Заказ_Key = trim($РасшифровкаПлатежа['Заказ']);
        
        if (!array_key_exists($Заказ_Key,$Заказы)) { continue; }
        
        $Заказы[$Заказ_Key]['ДатаПлатежки'][] = $ДатаПлатежки;
        $Заказы[$Заказ_Key]['ПоследняяДатаПлатежки'] = max($Заказы[$Заказ_Key]['ДатаПлатежки']);
        
        $Заказы[$Заказ_Key]['СуммаПлатежки'][] = trim($РасшифровкаПлатежа['Сумма']);
        $Заказы[$Заказ_Key]['ОбщаяСуммаПлатежки'] += trim($РасшифровкаПлатежа['Сумма']);
    }
}
//******************************************************************************
$raw = get1cData('Document_ПриходныйКассовыйОрдер',
			'РасшифровкаПлатежа,Date',
			''
				);
foreach ($raw as $КассовыйЧек) {
    $ДатаЧека = strtotime(trim($КассовыйЧек['Date']));
    
    foreach ($КассовыйЧек['РасшифровкаПлатежа'] as $РасшифровкаПлатежа) {
        if ($РасшифровкаПлатежа['Заказ_Type'] != 'StandardODATA.Document_ЗаказКлиента') { continue; }
        if ($РасшифровкаПлатежа['Заказ'] == '00000000-0000-0000-0000-000000000000') { continue; }
        
        $Заказ_Key = trim($РасшифровкаПлатежа['Заказ']);
        
        if (!array_key_exists($Заказ_Key,$Заказы)) { continue; }
        
        $Заказы[$Заказ_Key]['ДатаЧека'][] = $ДатаЧека;
        $Заказы[$Заказ_Key]['ПоследняяДатаЧека'] = max($Заказы[$Заказ_Key]['ДатаЧека']);
        
        $Заказы[$Заказ_Key]['СуммаЧека'][] = trim($РасшифровкаПлатежа['Сумма']);
        $Заказы[$Заказ_Key]['ОбщаяСуммаЧека'] += trim($РасшифровкаПлатежа['Сумма']);
    }
}
//******************************************************************************
$tasks = get1cData('Document_ЗаказКлиента',
								'Ref_Key,Number,СуммаДокумента,ДатаОтгрузки,Менеджер_Key,Контрагент_Key,Организация_Key,Партнер_Key,Date',
                                ''
								);
foreach ($tasks as $single_task) {
    $Заказ_Key = trim($single_task['Ref_Key']);
    if (!array_key_exists($Заказ_Key,$Заказы)) { continue; }
    if (array_key_exists(trim($single_task['Контрагент_Key']),$nouse_Контрагенты)) { continue; }
    
    $Заказы[$Заказ_Key]['Number'] = trim($single_task['Number']);
    $Заказы[$Заказ_Key]['СуммаДокумента'] = trim($single_task['СуммаДокумента']);
    $Заказы[$Заказ_Key]['Менеджер_Key'] = trim($single_task['Менеджер_Key']);
    $Заказы[$Заказ_Key]['Партнер_Key'] = trim($single_task['Партнер_Key']);
    $Заказы[$Заказ_Key]['ДатаЗаказа'] = strtotime(trim($single_task['Date']));
    $Заказы[$Заказ_Key]['Контрагент_Key'] = trim($single_task['Контрагент_Key']);
    $Заказы[$Заказ_Key]['Партнер_Key'] = trim($single_task['Партнер_Key']);
    $Заказы[$Заказ_Key]['Организация_Key'] = trim($single_task['Организация_Key']);
}
//~ print_r($Заказы);
//~ exit;
//******************************************************************************
$time1 = strtotime(date('Y-m-d\TH:i:s',mktime(0, 0, 0, date("m"), date("1"), date("Y"))));
$time2 = strtotime(date('Y-m-d\TH:i:s',mktime(0, 0, 0, date("m")+1, date("1"), date("Y"))));

//~ $output = 'Дата;Номер Заказа;Сумма заказа;Клиент;Организация;Реализации;Оплаты;Менеджер заказа; Менеджер клиента'.PHP_EOL;
$output = '<th>Дата</th><th>Номер Заказа</th><th>Сумма заказа</th><th style="width:  8.33%">Клиент</th><th>Организация</th><th>Реализации</th><th>Оплаты</th><th>Менеджер заказа</th><th>Менеджер клиента</th>'.PHP_EOL;
foreach ($Заказы as $Ref_Key => $Заказ) {
    
    if ( !array_key_exists('СуммаДокумента',$Заказ) ) { continue; } // если нет отгрузки, пропускаем
    if ( $Заказ['ПоследняяДатаРеализации'] == 0 ) { continue; } // если нет отгрузки, пропускаем
    if (( $Заказ['ПоследняяДатаПлатежки'] == 0 )
        and ( $Заказ['ПоследняяДатаЧека'] == 0 )) { continue; } //если нет оплаты нал/безнал, пропускаем

    
    $ВсяСуммаОплаты = $Заказ['ОбщаяСуммаПлатежки'] + $Заказ['ОбщаяСуммаЧека'];
    
    if ($ВсяСуммаОплаты == $Заказ['СуммаДокумента']) {
        $ПоследняяДата = max($Заказ['ПоследняяДатаРеализации'],$Заказ['ПоследняяДатаПлатежки'],$Заказ['ПоследняяДатаЧека']);
        
        if (($ПоследняяДата < $time2) and ($ПоследняяДата >= $time1)) {
            
            $Партнер_Key = $Партнеры[$Заказ['Партнер_Key']]['ОсновнойМенеджер_Key'];
            if (!array_key_exists($Партнер_Key,$Менеджеры)) {
                $Менеджер_клиента = 'нет менеджера клиента';
            } else {
                $Менеджер_клиента = $Менеджеры[$Партнер_Key];
            }
            
            // собираем отгрузки
            $Реализации = '';
            foreach ($Заказ['ДатаРеализации'] as $key => $ДатаРеализации) {
                $Реализации .= 'Дата: '.date('d.m.Y',$ДатаРеализации).'<br>';
                $Реализации .= 'Сумма: '.$Заказ['СуммаРеализации'][$key].'<br>';
            }
            
            // собираем безнал платежки
            $ОплатыБН = '';
            foreach ($Заказ['ДатаПлатежки'] as $key => $ДатаОплаты) {
                $ОплатыБН .= 'Дата: '.date('d.m.Y',$ДатаОплаты).'<br>';
                $ОплатыБН .= 'Сумма безнал: '.$Заказ['СуммаПлатежки'][$key].'<br>';
            }
            
            //собираем наличные платежы
            $ОплатыНал = '';
            foreach ($Заказ['ДатаЧека'] as $key => $ДатаОплаты) {
                $ОплатыНал .= 'Дата: '.date('d.m.Y',$ДатаОплаты).'<br>';
                $ОплатыНал .= 'Сумма нал: '.$Заказ['СуммаЧека'][$key].'<br>';
            }
            
            $output .= '<tr>';
            $output .= '<td>'.date('d.m.Y H:i',$Заказ['ДатаЗаказа']).'</td>';
            $output .= '<td>'.$Заказ['Number'].'</td>';
            $output .= '<td>'.str_replace('.',',',$Заказ['СуммаДокумента']).'</td>';
            $output .= '<td>'.$Контрагенты[$Заказ['Контрагент_Key']].'</td>';
            $output .= '<td>'.$Организации[$Заказ['Организация_Key']].'</td>';
            $output .= '<td>'.$Реализации.'</td>';
            $output .= '<td>'.$ОплатыБН.$ОплатыНал.'</td>';
            $output .= '<td>'.$Менеджеры[$Заказ['Менеджер_Key']].'</td>';
            $output .= '<td>'.$Менеджер_клиента.'</td>'.PHP_EOL;
            $output .= '</tr>';
        }
    }
    
}
$htmlout = '<!DOCTYPE html><html>'.PHP_EOL.
		'<head>'.PHP_EOL.
		'<title>Зарплата</title>'.PHP_EOL.
		'<meta charset="utf-8">'.PHP_EOL.
        '<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">'.PHP_EOL.
        '<!-- Bootstrap CSS --><link rel="stylesheet" href="css/bootstrap.min.css">'.PHP_EOL.
		'</head>'.PHP_EOL.
		'<body>'.PHP_EOL.
		'<h1>Зарплата</h1>'.PHP_EOL.
		'<table class="table table-hover">'.PHP_EOL;
$htmlout .= $output;
$htmlout .= '</table>'.PHP_EOL.
            '<script src="js/bootstrap.min.js"></script>'.PHP_EOL.
            '</body></html>'.PHP_EOL;
echo $htmlout;
